# cask_args appdir: '/Applications'


# fnm go rust 
# fzf eza jq ripgrep
# zoxide
# cask orbstack

tap "felixkratz/formulae"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "jesseduffield/lazygit"
tap "hashicorp/tap"
tap "sst/tap"

brew "ansible"
brew "ansible-lint"
brew "bat"
brew "btop"
brew "colima"
brew "coreutils"
brew "diff-so-fancy"
brew "eza"
brew "fish"
brew "fzf"
brew "git"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "htop"
brew "imapsync"
brew "jq"
brew "kdoctor"
brew "lazydocker"
brew "mas"
brew "neofetch"
brew "neovim"
brew "php@8.1", link: true
brew "pinentry-mac"
brew "pnpm"
brew "powerlevel10k"
brew "ripgrep"
brew "ruby"
brew "sst"
brew "starship"
brew "stow"
brew "stylua"
brew "thefuck"
brew "terraform"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"

cask "1password"
cask "alacritty"
cask "arc"
cask "bitwarden"
cask "blender"
cask "bruno"
cask "cyberduck"
# cask "dbeaver-community"
cask "discord"
cask "docker"
cask "figma"
cask "font-geist-mono-nerd-font"
cask "font-sf-pro"
cask "hiddenbar"
cask "iina"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "keybase"
cask "latest"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "miro"
cask "mongodb-compass"
cask "obsidian"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "sf-symbols"
cask "spotify"
cask "todoist"
cask "visual-studio-code"
cask "wezterm"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "ArmorLock", id: 1528614234
mas "Developer", id: 640199958
mas "Goodnotes 6", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MeetingBar", id: 1532419400
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
mas "Usage", id: 1561788435
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "antfu.file-nesting"
vscode "antfu.icons-carbon"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bazelbuild.vscode-bazel"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "janbiasi.gotthard-theme"
vscode "johnpapa.vscode-cloak"
vscode "justusadam.language-haskell"
vscode "kdl-org.kdl"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "sourcegraph.cody-ai"
vscode "sumneko.lua"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
