tap "ariga/tap"
tap "asheshgoplani/tap"
tap "charmbracelet/tap"
tap "cyclonedx/cyclonedx"
tap "dicklesworthstone/tap"
tap "felixkratz/formulae"
tap "honeymux/tap"
tap "lusingander/tap"
tap "modem-dev/tap"
tap "netbirdio/tap"
tap "nikitabobko/tap"
tap "nocodb/nocodb"
tap "oven-sh/bun"
tap "protonpass/tap"
tap "sdkman/tap"
tap "steipete/tap"
tap "steveyegge/beads"
tap "typewhisper/tap"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Git for Data
brew "dolt"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "jwt-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# Pins GitHub Actions to full hashes and versions
brew "pinact"
# Tool for managing OCI containers and pods
brew "podman"
# QR Code generation
brew "qrencode"
# Rust toolchain installer
brew "rustup"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Smart session manager for the terminal
brew "sesh"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# General purpose fuzzy finder TUI
brew "television"
# Terminal multiplexer
brew "tmux"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Your CLI home video recorder
brew "vhs"
# Convert HTML to PDF
brew "weasyprint"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze", trusted: true
# CLI tool for CycloneDX analysis, merging, diffs and format conversions
brew "cyclonedx/cyclonedx/cyclonedx-cli", trusted: true
# Graph-aware task management TUI for beads projects
brew "dicklesworthstone/tap/bv", link: false, trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# A new UX layer for the terminal, built on tmux
brew "honeymux/tap/hmx", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Netbird project.
brew "netbirdio/tap/netbird", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
# Proton Pass CLI - Command-line interface for Proton Pass
brew "protonpass/tap/pass-cli", trusted: true
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli", trusted: true
# AI-supervised issue tracker for coding workflows
brew "steveyegge/beads/bd", trusted: true
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Tools for building Android applications
cask "android-studio"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# User-friendly GUI app for Homebrew
cask "applite"
# 3D creation suite
cask "blender"
# Send any size file between devices
cask "blip"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# UI for running multiple coding agents in parallel
cask "emdash"
# Manage FIDO2.1 security keys
cask "fido2-manage"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-symbols-2"
# Web browser
cask "google-chrome"
# Chromium-based web browser
cask "helium-browser"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Keyboard customiser
cask "karabiner-elements"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Netbird UI Client
cask "netbirdio/tap/netbird-ui", trusted: true
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# Self-hosted daemon for AI coding agents
cask "paseo"
# Client for Proton Drive
cask "proton-drive"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Minimal GUI for AI code agents
cask "t3-code"
# Menu bar manager
cask "thaw"
# Customizable email client
cask "thunderbird"
# To-do list
cask "todoist-app"
# Markdown knowledgebase manager
cask "tolaria"
# Speech-to-text and AI text processing
cask "typewhisper/tap/typewhisper", trusted: true
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Canary Mail", id: 1236045954
mas "keymapp", id: 6472865291
mas "Logic Pro", id: 634148309
mas "NordVPN", id: 905953485
mas "Proton Pass for Safari", id: 6502835663
mas "Xcode", id: 497799835
vscode "a-h.templ"
vscode "angular.ng-template"
vscode "antfu.icons-carbon"
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "clinyong.vscode-css-modules"
vscode "coderabbit.coderabbit-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-preview"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "jakebecker.elixir-ls"
vscode "janbiasi.pslint-vscode"
vscode "jetpack-io.devbox"
vscode "lokalise.i18n-ally"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "phoenixframework.phoenix"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sanjulaganepola.github-local-actions"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/gotesttools/gotestfmt/v2/cmd/gotestfmt"
go "github.com/hloiseaufcms/mcp-gopls/cmd/mcp-gopls"
go "github.com/vektra/mockery/v3"
go "github.com/google/oss-rebuild/cmd/oss-rebuild"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/janbiasi/pslint/cmd/pslint"
go "github.com/janbiasi/pslint/cmd/pslint-inspect"
go "github.com/janbiasi/pslint/cmd/pslintls"
go "github.com/riverqueue/river/cmd/river"
go "github.com/joshmedeski/sesh/v2"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/caarlos0/svu/v3"
go "github.com/swaggo/swag/v2/cmd/swag"
go "github.com/a-h/templ/cmd/templ"
go "github.com/mfridman/tparse"
go "github.com/janbiasi/treepolicy/cmd/treepolicy"
go "github.com/janbiasi/treepolicy/cmd/treepolicy-inspect"
go "github.com/janbiasi/treepolicy/cmd/treepolicy-mcp"
go "github.com/janbiasi/treepolicy/cmd/treepolicyls"
go "github.com/google/wire/cmd/wire"
uv "posting"
uv "sqlit-tui", with: ["mysql-connector-python", "psycopg2-binary", "pyodbc"]
npm "@earendil-works/pi-coding-agent"
npm "@google/gemini-cli"
npm "@plannotator/pi-extension"
npm "@sgkb-sow/cli"
npm "corepack"
npm "generator-code"
npm "generator-generator"
npm "hunkdiff"
npm "opencode-ai"
npm "opencode-swarm-plugin"
npm "pi-mcp-adapter"
npm "yo"
