tap "ariga/tap"
tap "charmbracelet/tap"
tap "cyclonedx/cyclonedx"
tap "dicklesworthstone/tap"
tap "felixkratz/formulae"
tap "lusingander/tap"
tap "netbirdio/tap"
tap "nikitabobko/tap"
tap "nocodb/nocodb"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "steipete/tap"
tap "steveyegge/beads"
brew "asciinema"
brew "autoconf"
brew "bat"
brew "btop"
brew "coreutils"
brew "curl"
brew "curlie"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "elixir"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fop"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gnupg"
brew "go"
brew "jq"
brew "jwt-cli"
brew "lazygit"
brew "libpq"
brew "lnav"
brew "mas"
brew "mole"
brew "neovim"
brew "nushell"
brew "ollama"
brew "ripgrep"
brew "opencode"
brew "osv-scanner"
brew "podman"
brew "qrencode"
brew "rustup"
brew "scc"
brew "sesh"
brew "starship"
brew "stow"
brew "syft"
brew "tailscale", restart_service: :changed
brew "tmux"
brew "ttyd"
brew "vhs"
brew "wimlib"
brew "wxwidgets"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/freeze"
brew "cyclonedx/cyclonedx/cyclonedx-cli"
brew "dicklesworthstone/tap/bv", link: false
brew "felixkratz/formulae/borders"
brew "lusingander/tap/serie"
brew "netbirdio/tap/netbird"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
brew "steveyegge/beads/bd"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "android-studio"
cask "applite"
cask "blender"
cask "blip"
cask "bruno"
cask "steipete/tap/codexbar"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-symbols-2"
cask "google-chrome"
cask "helium-browser"
cask "intellij-idea-ce"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "localsend"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "monitorcontrol"
cask "netbirdio/tap/netbird-ui"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "proton-pass"
cask "thunderbird"
cask "todoist-app"
cask "vscodium"
cask "yaak"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Canary Mail", id: 1236045954
mas "keymapp", id: 6472865291
mas "Logic Pro", id: 634148309
mas "NordVPN", id: 905953485
mas "Structured", id: 1499198946
mas "Xcode", id: 497799835
vscode "a-h.templ"
vscode "angular.ng-template"
vscode "antfu.icons-carbon"
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "clinyong.vscode-css-modules"
vscode "coderabbit.coderabbit-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-preview"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "jakebecker.elixir-ls"
vscode "jetpack-io.devbox"
vscode "lokalise.i18n-ally"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "phoenixframework.phoenix"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sanjulaganepola.github-local-actions"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/goreleaser/goreleaser/v2"
go "github.com/gotesttools/gotestfmt/v2/cmd/gotestfmt"
go "github.com/hloiseaufcms/mcp-gopls/cmd/mcp-gopls"
go "github.com/vektra/mockery/v3"
go "github.com/google/oss-rebuild/cmd/oss-rebuild"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/riverqueue/river/cmd/river"
go "github.com/joshmedeski/sesh/v2"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/v2/cmd/swag"
go "github.com/a-h/templ/cmd/templ"
go "github.com/mfridman/tparse"
go "github.com/google/wire/cmd/wire"
uv "posting"
uv "sqlit-tui", with: ["mysql-connector-python", "psycopg2-binary", "pyodbc"]
